In [1]:
import pandas as np
import numpy as np
from pandas import Series,DataFrame

In [3]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [4]:
ser2 = ser1*2

In [5]:
ser2

a    0
b    2
c    4
dtype: int32

In [6]:
ser1['b']

1

In [7]:
ser1[1]

1

In [8]:
ser1[0:3]

a    0
b    1
c    2
dtype: int32

In [11]:
ser1[['a','b']]

a    0
b    1
dtype: int32

In [13]:
ser2[ser2>3]

c    4
dtype: int32

In [17]:
ser2[ser2>3]=10
ser2

a     0
b     2
c    10
dtype: int32

In [18]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=('NYC','SF','LA','DC','CHI'),
                                               columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
SF    5   6   7   8   9
LA   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [19]:
dframe['B']

NYC     1
SF      6
LA     11
DC     16
CHI    21
Name: B, dtype: int32

In [20]:
dframe[['B','E']]

      B   E
NYC   1   4
SF    6   9
LA   11  14
DC   16  19
CHI  21  24

In [22]:
dframe[dframe['C']>8]

      A   B   C   D   E
LA   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [23]:
dframe>10

         A      B      C      D      E
NYC  False  False  False  False  False
SF   False  False  False  False  False
LA   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [26]:
dframe.loc['LA']

A    10
B    11
C    12
D    13
E    14
Name: LA, dtype: int32

In [27]:
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: SF, dtype: int32